
/*** Build Menu ***/

"Build Results" = "Resultados de construcción";

"Hide Build Log Window" = "Ocultar ventana de construcción";

/*** Build Window ***/

"%@ - Build Log" = "%@ - Resultados de construcción";

/*** CLEAN ***/

/* Clean Sheet */

"clean title" = "Advertencia";

"clean message" = "La limpieza eliminará todos los paquetes y distribuciones de la ubicación de compilación.";

"Clean" = "Limpiar";

"Cleaning..." = "Limpiando…";


"Clean %@" = "Limpiar %@";

"Clean Succeeded \t%@" = "Limpieza exitosa \t%@";

"Clean Failed \t%@" = "Limpieza fallada \t%@";

"1 error" = "1 error";

"%ld errors" = "%ld errors";




"Build %@" = "Construcción %@";

"Project %@" = "Proyecto %@";


/* State */

"Building..." = "Construyendo…";

"Building package..." = "Construyendo paquete…";

"Building %lu of 1 package..." = "Construyendo %lu de 1 paquete…";

"Building %lu of %lu packages..." = "Building %lu de %lu paquetes…";

"Build failed" = "Construcción fallida";

"Build Failed \t%@" = "Construcción fallida \t%@";

"Build succeeded" = "Construcción exitosa";

"Build Succeeded \t%@" = "Construcción exitosa \t%@";

/* User Notification */

"Build Failed" = "Construcción fallida";

"Build Succeeded" = "Construcción exitosa";

/* NSFileManager Errors */

"Error removing" = "Error al eliminar el archivo. Compruebe que tiene los permisos adecuados para eliminar este ítem.";

/* Error and progression strings */

"Create package" = "Crear paquete";

"Create reference to package" = "Crear referencia al paquete";

"Import package" = "Importar paquete";




"Copy background image" = "Copiar la imagen de fondo";


"Copy conclusion documents" = "Copiar los documentos del resumen";


"Copy extra resources" = "Copiar los recursos adicionales";


"Copy Installer plugins" = "Copiar los complementos de Instalador";


"Copy introduction documents" = "Copiar los documentos de la introducción";


"Copy license documents" = "Copiar los documentos de la licencia";


"Copy readme documents" = "Copiar los documentos del léame";


"Create bill of materials" = "Crear lista de materiales";


"Create build folder" = "Crear la carpeta de la construcción";


"Create distribution script" = "Crear el script de la distribución";


"Create hierarchy of choices" = "Crear la jerarquía de elecciones.";


"Create installation and volume requirements" = "Crear los requisitos par la instalación y los volumenes";


"Create JavaScript code" = "Crear el codigo JavaScript";


"Create PackageInfo document" = "Copiar el documento PackageInfo";


"Create pax archive" = "Crear el archivo pax";


"Create payload" = "Crear la carga útil payload";


"Create xar archive" = "Crear el archivo xar";


"Distribution script and other resources" = "Script de distribución y otros recursos";


"Incorrect type for file at path '%@'" = "Tipo incorrecto para el archivo en la ruta “%@”";


"Incorrect value for object with tag '%@'" = "Valor incorrecto para el objeto con etiqueta '%@'";

"An absolute path can not be computed from path '%@'" = "Una ruta absoluta no se puede calcular desde la ruta “%@”";



"License template for \"%@\" can not be found" = "No se encuentra la plantilla de licencia para “%@”";


"No identifier could be found for the bundle at path '%@'" = "No se encuentra el identificador para el bundle en la ruta “%@”";


"Unable to extract information from the imported package at path '%@'" = "No se puede extraer información del paquete importado en la ruta “%@”";



"Missing build data for tag '%@'" = "Faltan datos de construcción para la etiqueta “%@”";




"The location of the package has not been fully defined." = "La ubicación del paquete no se ha definido completamente.";

"The identifier of the package can not be empty." = "El identificador del paquete no puede estar vacío.";

"The version of the package can not be empty." = "La versión del paquete no puede estar vacía.";

"The name of the package can not be empty." = "El nombre del paquete no puede estar vacío.";

"The name of the project can not be empty." = "El nombre del proyecto no puede estar vacío.";


"Missing information for tag '%@'" = "Falta información para la etiqueta “%@”";

" because the item could not be found" = " porque el ítem no se pudo encontrar";

"The existing folder at path '%@' can not be used as a build folder because it's not a writable folder." = "La carpeta existente en la ruta “%@” no se puede usar como una carpeta de compilación porque no es una carpeta de escritura.";

"%@ returned error code (%d)" = "%1$@ devolvió el código de error (%2$d)";

": %@" = ": %@";


"No issues" = "Sin problemas";

"Unknown Error" = "Error desconocido";

"Not enough memory to perform operation" = "No hay suficiente memoria para realizar la operación.";

"Language (%@) not supported" = "Idioma (% @) no es compatible";


"Scripts payload" = "Scripts de la carga útil";

"Assemble payload files" = "Ensamblar los archivos de al carga útil";

"Split forks" = "Dividar forks";


"Insufficient privileges to set accounts for path '%@'" = "Privilegios insuficientes para establecer cuentas para la ruta “%@”";

"Insufficient privileges to set permissions for path '%@'" = "Privilegios insuficientes para establecer permisos para la ruta “%@”";

"Insufficient privileges to write at path '%@'" = "Privilegios insuficientes para escribir en la ruta “%@”";


"Unable to set attributes of item at path '%@'" = "No se pueden establecer los atributos del ítem en la ruta “%@”";

"Unable to read attributes of item at path '%@'" = "No se pueden leer los atributos del elemento en la ruta “%@”";


"Unable to set extended attributes of item at path '%@'" = "No se pueden establecer los atributos extendidos del ítem en la ruta “%@”";

"Unable to read extended attributes of item at path '%@'" = "No se pueden leer los atributos extendidos del elemento en la ruta “%@”";


"String can not be empty for tag '%@'" = "La cadena no puede estar vacía para la etiqueta “%@”";

"Unable to copy item at path '%@'" = "No se puede copiar el elemento en la ruta “%@”";


"Unable to automatically determine the value for hostArchitectures" = "No se puede determinar automáticamente el valor de hostArchitectures";


"Unable to communicate with packages_dispatcher. The permissions of the fr.whitebox.packages.build.dispatcher.plist launchd configuration file in /Library/LaunchDaemons are incorrect." = "No se puede comunicar con packages_dispatcher. Los permisos del archivo de configuración de launchd fr.whitebox.packages.build.dispatcher.plist en /Library/LaunchDaemons son incorrectos.";

"Unable to communicate with packages_dispatcher. The fr.whitebox.packages.build.dispatcher.plist launchd configuration file is missing in /Library/LaunchDaemons." = "No se puede comunicar con packages_dispatcher. Falta el archivo de configuración de launchd fr.whitebox.packages.build.dispatcher.plist en /Library/LaunchDaemons. Para solucionar este problema, puede reinstalar Packages.";

"packages_dispatcher is not responding. Have you disabled or unloaded the fr.whitebox.packages.build.dispatcher.plist launchd configuration file?" = "package_dispatcher no responde. ¿Ha desactivado o descargado el archivo de configuración de launchd fr.whitebox.packages.build.dispatcher.plist?";


	/* item type */

"the file" = "el archivo";

"the folder" = "la carpeta";

"the plugin" = "el complemento";

"the tool" = "la herramienta";

"the package" = "el paquete";

"the bundle" = "the bundle";


"Unable to create %@ at path '%@'" = "No se puede crear %@ en la ruta “%@”";

"Unable to delete %@ at path '%@'" = "No se puede eliminar %@ en la ruta “%@”";

"Unable to find %@ at path '%@'" = "No se puede encontrar %@ en la ruta “%@”";

"Unable to read %@ at path '%@'" = "No se puede leer %@ en la ruta “%@”";


"Unable to find tool '%@'" = "No se puede encontrar la herramienta '%@'";

" because the disk is read only" = " porque el disco es de solo lectura";

" because there's no space left on disk" = " porque no queda espacio en el disco";

" because you don't have permission to create it inside the folder \'%@\'" = " porque no tienes permiso para crearlo dentro de la carpeta “%@”";

" because you don't have permission to access it" = " porque no tienes permiso para accederlo";

" because packages_builder doesn't have permission to access it" = " porque pcakages_builder no tiene permiso para accederlo";



	/* Requirements and Locators errors */

"Converter not found for requirement of type '%@'" = "No se encontró el convertidor para el requisito del tipo “%@”";

"No code generated for requirement '%@'" = "No se genera código para el requisito “%@”";

"Converter not found for locator of type '%@'" = "Convertidor no encontrado para el localizador de tipo “%@”";

"No code generated for locator '%@'" = "No se genera código para el localizador “%@”";


" because the parameter %@ is missing" = " porque falta el parámetro %@";

" because the parameter %@ is invalid" = " porque el parámetro %@ no es válido";

" because available memory is too low" = " porque la memoria disponible es demasiado baja";

/* Signing errors */

"Unable to sign the data (%d)" = "No se pueden firmar los datos (%d)";

"Signing operation timed out" = "La operación de firma ha caducado";

"Signing operation denied" = "Operación de firma denegada";

"Unable to find signing certificate" = "No se puede encontrar el certificado de firma";

"Unable to find keychain" = "No se puede encontrar el llavero";

"Unable to find the private key for the Developer ID Installer certificate" = "No se puede encontrar la clave privada para el certificado Developer ID Installer";

"The Developer ID Installer certificate is expired." = "El certificado Developer ID Installer utilizado para este proyecto ha caducado.";

"The chain for the Developer ID Installer certificate can not be trusted." = "No se puede confiar en la cadena para el certificado Developer ID Installer.";

"The Developer ID Installer certificate is not trusted." = "El certificado Developer ID Installer utilizado para este proyecto no es de confianza.";

"Unable to get a trusted timestamp because the Timestamp Authority Server is not available." = "No se puede obtener una marca de tiempo confiable porque el servidor de marca de tiempo no está disponible.";
